# Classification Exercises

## 1.) In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [4]:
# py import method

from pydataset import data

data('iris', show_doc=True)

df_iris = data('iris')

iris

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Edgar Anderson's Iris Data

### Description

This famous (Fisher's or Anderson's) iris data set gives the measurements in
centimeters of the variables sepal length and width and petal length and
width, respectively, for 50 flowers from each of 3 species of iris. The
species are _Iris setosa_, _versicolor_, and _virginica_.

### Usage

    iris
    iris3

### Format

`iris` is a data frame with 150 cases (rows) and 5 variables (columns) named
`Sepal.Length`, `Sepal.Width`, `Petal.Length`, `Petal.Width`, and `Species`.

`iris3` gives the same data arranged as a 3-dimensional array of size 50 by 4
by 3, as represented by S-PLUS. The first dimension gives the case number
within the species subsample, the second the measurements with names `Sepal
L.`, `Sepal W.`, `Petal L.`, and `Petal W.`, and the third the species.

### Source

Fisher, R. A. (1936) The use of multiple measurements in taxonomic problems.
_Annals of Eugenics_, **7**, Part II, 179–188.

The data were collected by Anderson, Edgar (1935). The irises of the Gaspe
Peninsula, _Bulletin of the American Iris Society_, **59**, 2–5.

### References

Becker, R. A., Chambers, J. M. and Wilks, A. R. (1988) _The New S Language_.
Wadsworth & Brooks/Cole. (has `iris3` as `iris`.)

### See Also

`matplot` some examples of which use `iris`.

### Examples

    dni3 <- dimnames(iris3)
    ii <- data.frame(matrix(aperm(iris3, c(1,3,2)), ncol = 4,
                            dimnames = list(NULL, sub(" L.",".Length",
                                            sub(" W.",".Width", dni3[[2]])))),
        Species = gl(3, 50, labels = sub("S", "s", sub("V", "v", dni3[[3]]))))
    all.equal(ii, iris) # TRUE

In [5]:
df_iris.head(10)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1            5.1          3.5           1.4          0.2  setosa
2            4.9          3.0           1.4          0.2  setosa
3            4.7          3.2           1.3          0.2  setosa
4            4.6          3.1           1.5          0.2  setosa
5            5.0          3.6           1.4          0.2  setosa
6            5.4          3.9           1.7          0.4  setosa
7            4.6          3.4           1.4          0.3  setosa
8            5.0          3.4           1.5          0.2  setosa
9            4.4          2.9           1.4          0.2  setosa
10           4.9          3.1           1.5          0.1  setosa

In [6]:
#seaborn method

In [7]:
import seaborn as sns

In [8]:
import numpy as np

In [9]:
df_iris_seaborn_method = sns.load_dataset('iris')

In [10]:
df_iris_seaborn_method.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [11]:
# a.)print the first 3 rows

In [12]:
df_iris.iloc[:3]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [13]:
#b.) print the number of rows and columns (shape)

In [14]:
df_iris.shape

(150, 5)

In [15]:
# c.) print the column names
for col in df_iris.columns:
    print(col)

Sepal.Length
Sepal.Width
Petal.Length
Petal.Width
Species

In [16]:
#d. print the data type of each column
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [17]:
# e.)print the summary statistics for each of the numeric variables. 
# Would you recommend rescaling the data based on these statistics?

df_iris.describe()

# I would not rescale.

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [18]:
import pandas as pd

### 2.) Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

just note:

if you are using ravinders excel to delete the first row which contains empty columns can use below.

- churn_df.columns = churn_df.iloc[0]
- churn_df = churn_df.drop(churn_df.index[0]

In [19]:
# a.) assign the first 100 rows to a new dataframe, df_excel_sample
df_excel = pd.read_excel('df_excel.xlsx', sheet_name='Table1_CustDetails')
df_excel.head(10)

df_excel_sample = df_excel.head(100)

use pandas methods and attributes to do some initial summarization and exploration of your data.

- .head()

- .shape

- .info()

- .columns

- .dtypes

- .describe()

- .value_counts()

In [20]:
# b.) print the number of rows of your original dataframe
df_excel.shape

(7043, 12)

In [21]:
# c.) print the first 5 column names
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [22]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7043 non-null   object
 1   gender             7043 non-null   object
 2   is_senior_citizen  7043 non-null   int64
 3   partner            7043 non-null   object
 4   dependents         7043 non-null   object
 5   phone_service      7043 non-null   int64
 6   internet_service   7043 non-null   int64
 7   contract_type      7043 non-null   int64
 8   payment_type       7043 non-null   object
 9   monthly_charges    7043 non-null   float64
 10  total_charges      7032 non-null   float64
 11  churn              7043 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 660.4+ KB

In [23]:
# d.) print the column names that have a data type of object
object_column = df_excel.select_dtypes(include='object').columns
object_column

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [24]:
# another method to get columns which are data types is df_excel.where

In [25]:
# e.) compute the range for each of the numeric variables.
numeric_variables = df_excel.select_dtypes(include=['float64', 'int64'] ).columns
numeric_variables

Index(['is_senior_citizen', 'phone_service', 'internet_service',
       'contract_type', 'monthly_charges', 'total_charges'],
      dtype='object')

In [26]:
numeric_variables = df_excel.select_dtypes(include=[np.number] ).columns
numeric_variables

Index(['is_senior_citizen', 'phone_service', 'internet_service',
       'contract_type', 'monthly_charges', 'total_charges'],
      dtype='object')

In [27]:

numeric_v = df_excel.select_dtypes(include=[np.number])

numeric_v_range = numeric_v.max() - numeric_v.min()
numeric_v_range

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

### 3.) Read the data from this google sheet into a dataframe, df_google

In [29]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
train_googlesheet = pd.read_csv(csv_export_url)
train_googlesheet.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C

In [74]:
# a.) print the first 3 rows
train_googlesheet.iloc[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [76]:
# b.) print the number of rows and columns
train_googlesheet.shape

(891, 12)

In [80]:
# c.) print the column names
train_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
# d.) print the data type of each column
train_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [33]:
# e.) print the summary statistics for each of the numeric variables
train_googlesheet.select_dtypes(include = ['int64', 'float64']).describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [46]:
# f.) print the unique values for each of your categorical variables
unique_cat = train_googlesheet.nunique()

In [49]:
(train_googlesheet.loc[:, train_googlesheet.nunique() < 10]).value_counts()

Survived  Pclass  Sex     SibSp  Parch  Embarked
0         3       male    0      0      S           177
          2       male    0      0      S            61
          1       male    0      0      S            35
          3       male    0      0      C            28
                                        Q            27
1         3       male    0      0      S            25
          2       female  0      0      S            25
          3       female  0      0      Q            19
          1       female  0      0      C            17
                  male    0      0      S            17
0         3       female  0      0      S            16
1         1       female  1      0      C            15
0         1       male    0      0      C            15
          3       male    1      0      S            15
1         3       female  0      0      S            14
          1       female  0      0      S            14
                          1      0      S            13
0         2       male    1      0      S            10
          1       male    1      0      S             9
1         1       male    0      0      C             8
          2       female  1      1      S             8
0         3       female  1      0      S             8
1         2       female  0      1      S             7
                          1      0      S             7
0         3       male    2      0      S             6
1         2       male    0      0      S             6
0         3       female  0      0      Q             6
                  male    1      1      S             6
1         1       female  0      1      S             6
          2       male    1      1      S             6
          1       male    1      0      C             5
                                        S             5
          2       female  0      2      S             5
          3       male    0      0      C             5
0         3       female  3      1      S             5
                  male    4      1      S             5
1         3       female  1      0      S             5
0         3       male    5      2      S             4
          1       male    0      1      C             4
          3       male    1      0      Q             4
1         1       female  0      1      C             4
0         3       male    4      1      Q             4
1         1       female  0      2      S             4
          3       female  0      0      C             4
0         2       male    1      1      S             4
1         3       female  1      1      S             4
          1       female  1      1      S             4
          2       female  1      2      S             4
0         3       female  4      2      S             4
                  male    8      2      S             4
1         3       female  1      0      Q             4
0         3       female  1      1      S             3
1         1       female  1      1      C             3
          3       female  0      2      C             3
                          2      1      C             3
                          0      1      S             3
                                 2      S             3
          1       male    1      2      S             3
0         2       male    1      0      C             3
                  female  0      0      S             3
1         3       male    1      1      C             3
                                        S             3
0         1       male    1      0      C             3
          3       female  1      0      C             3
          2       male    2      0      S             3
          1       male    0      1      S             3
          3       female  8      2      S             3
          2       male    0      0      C             3
1         2       female  1      0      C             3
0         3       male    3      2      S             2
                                 1      S             2
1         3       female  1      0      C             2
0         3       male    1      2      S             2
                  female  0      1      C             2
                  male    1      1      C             2
1         3       male    1      0      S             2
0         3       male    1      0      C             2
          1       female  1      2      S             2
          3       female  3      2      S             2
                          2      2      S             2
                          0      2      S             2
                  male    0      1      S             2
1         3       female  4      2      S             2
                  male    0      0      Q             2
          1       female  3      2      S             2
0         2       female  1      0      S             2
1         2       female  2      1      S             2
                          1      2      C             2
                          0      0      Q             2
          1       male    0      1      C             2
0         1       male    0      2      C             2
1         2       female  0      0      C             2
          1       female  2      2      C             2
0         1       male    1      1      S             2
1         1       female  1      2      S             2
0         3       male    4      2      S             2
          2       male    0      2      S             1
          3       female  0      1      S             1
          1       male    1      4      S             1
                          2      0      Q             1
          3       female  0      5      S             1
                                        Q             1
                                 4      S             1
          1       male    3      2      S             1
          3       female  0      2      Q             1
          2       male    1      2      C             1
                  female  1      1      S             1
                  male    0      0      Q             1
                          1      1      C             1
          3       female  0      2      C             1
          1       male    1      1      C             1
          3       female  0      0      C             1
                          1      1      C             1
          2       male    1      2      S             1
                          0      1      S             1
                          2      1      S             1
1         3       male    4      2      S             1
0         3       female  1      1      Q             1
1         3       female  0      3      C             1
          2       female  2      3      S             1
                          3      0      S             1
                  male    0      0      C             1
                                 2      C             1
                                        S             1
                          1      0      S             1
                          2      1      S             1
          3       female  0      1      C             1
                          1      1      C             1
          1       male    2      0      S             1
          3       female  1      5      S             1
                          2      0      Q             1
                          3      0      S             1
                  male    0      1      C             1
                                        S             1
                                 2      S             1
                          1      0      C             1
                                 2      S             1
          2       female  1      3      S             1
          1       male    1      1      S             1
0         3       female  1      2      S             1
                  male    1      3      S             1
                  female  1      3      S             1
                                 4      S             1
                                 5      S             1
                                 6      S             1
                          2      0      S             1
                          5      2      S             1
                  male    0      2      S             1
                          1      1      Q             1
                                 4      S             1
1         1       male    1      1      C             1
0         3       male    1      5      S             1
                          2      0      C             1
1         3       male    2      0      Q             1
          1       female  0      2      C             1
                          1      0      Q             1
                          2      0      S             1
                  male    0      2      C             1
                                        S             1
0         1       female  0      0      C             1
dtype: int64

### Make a new python module, acquire.py to hold the following data aquisition functions:

In [ ]:
#1.) Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. 
#Obtain your data from the Codeup Data Science Database.

import pandas as pd
import numpy as np
import os
from env import host, user, password

###################### Acquire Titanic Data ######################

def get_connection(db, user=user, host=host, password=password):
    '''
    This function uses my info from my env file to
    create a connection url to access the Codeup db.
    '''
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'
    
    
def new_titanic_data():
    '''
    This function reads the titanic data from the Codeup db into a df,
    write it to a csv file, and returns the df.
    '''
    # Create SQL query.
    sql_query = 'SELECT * FROM passengers'
    
    # Read in DataFrame from Codeup db.
    df = pd.read_sql(sql_query, get_connection('titanic_db'))
    
    return df

In [ ]:
#2.) Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. 
#The returned data frame should include the actual name of the species in addition to the species_ids. 
#Obtain your data from the Codeup Data Science Database.

###################### Acquire Iris Data ######################

def new_iris_data():
    '''
    This function reads the iris data from the Codeup db into a df.
    '''
    sql_query = """
                SELECT species_id,
                species_name,
                sepal_length,
                sepal_width,
                petal_length,
                petal_width
                FROM measurements
                JOIN species
                USING(species_id)
                """
    
    # Read in DataFrame from Codeup db.
    df = pd.read_sql(sql_query, get_connection('iris_db'))
    
    return df

In [ ]:
#3.) Once you've got your get_titanic_data and get_iris_data functions written, now it's time to add caching to them. 
# To do this, edit the beginning of the function to check for a local filename like titanic.csv or iris.csv. 
# If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

def get_iris_data(cached=False):
    '''
    This function reads in iris data from Codeup database and writes data to
    a csv file if cached == False or if cached == True reads in iris df from
    a csv file, returns df.
    '''
    if cached == False or os.path.isfile('iris_df.csv') == False:
        
        # Read fresh data from db into a DataFrame
        df = new_iris_data()
        
        # Cache data
        df.to_csv('iris_df.csv')
        
    else:
        
        # If csv file exists or cached == True, read in data from csv file.
        df = pd.read_csv('iris_df.csv', index_col=0)
        
    return df


def get_titanic_data(cached=False):
    '''
    This function reads in titanic data from Codeup database and writes data to
    a csv file if cached == False or if cached == True reads in titanic df from
    a csv file, returns df.
    '''
    if cached == False or os.path.isfile('titanic_df.csv') == False:
        
        # Read fresh data from db into a DataFrame.
        df = new_titanic_data()
        
        # Write DataFrame to a csv file.
        df.to_csv('titanic_df.csv')
        
    else:
        
        # If csv file exists or cached == True, read in data from csv file.
        df = pd.read_csv('titanic_df.csv', index_col=0)
        
    return df